# 2019 Stack Flow Developer Survey Data Set

### Import Dependencies

In [2]:
import pandas as pd

In [ ]:
filepath = "./ResourcesFiles/2019survey_results_public.csv" # Load the dataset.
alldata= pd.read_csv(filepath)#, index_col=0)
alldata.head(2)

#### Load Kaggle Data for Comparison

In [8]:
kagglefilepath = "../Gender_Gap_In_Tech_Survery_Data/kaggle_survey_2020_responses.csv" # Load the dataset.
kaggledata= pd.read_csv(kagglefilepath, usecols=[ 'Q1','Q2','Q3','Q4','Q5','Q6', 'Q24',]) #Read the Data as a Panda Dataframe 
header = [ 'Age','Gender','Country','Formal Education','Position','Year Coding', 'Salary',]# Set headers NAme 
kaggledata = kaggledata[1:] #take the data less the header row
kaggledata.columns = header #set the header row with header variable we created
kaggledf = kaggledata[(kaggledata['Country'] == 'United States of America')].dropna()#take only values with US & drop null values
# ReOrderheader = [ 'Country', 'Gender', 'Age','Formal Education','Position','Year Coding','Org Size', 'Salary',]
kaggledf.head(1)

,Age,Gender,Country,Formal Education,Position,Year Coding,Salary
2,30-34,Man,United States of America,Master’s degree,Data Engineer,5-10 years,"100,000-124,999"

# STACK OVER FLOW DATA

In [17]:
filepath = "./ResourcesFiles/2019survey_results_public.csv"  # Load the dataset.
stackdata= pd.read_csv(filepath, usecols=[ 'Age','Gender','Country','EdLevel','YearsCode','ConvertedComp',])#Read the Data as a Panda Dataframe
stack_df = stackdata[(stackdata['Country'] == 'United States')].dropna()#take only values with US & drop null values
#header =  ['Age','Gender','Country','Formal Education','Year Coding', 'Salary',] #Reindex/Rename Columns 
stack_df.head()

,Country,EdLevel,YearsCode,ConvertedComp,Age,Gender
3,United States,"Bachelor’s degree (BA, BS, B.Eng., etc.)",3,61000.0,22.0,Man
12,United States,"Master’s degree (MA, MS, M.Eng., MBA, etc.)",17,90000.0,28.0,Man
21,United States,Some college/university study without earning ...,35,103000.0,47.0,Man
22,United States,"Bachelor’s degree (BA, BS, B.Eng., etc.)",3,69000.0,22.0,Man
25,United States,Some college/university study without earning ...,12,114000.0,34.0,Man

In [11]:
stack_df.columns # Print Column Name

Index(['Country', 'EdLevel', 'YearsCode', 'ConvertedComp', 'Age', 'Gender'], dtype='object')

In [12]:
stack_df.dtypes # Print DataTypes

Country           object
EdLevel           object
YearsCode         object
ConvertedComp    float64
Age              float64
Gender            object
dtype: object

In [13]:
#Check for Null Values
for column in stack_df.columns:
    print(f"Column {column} has {stack_df[column].isnull().sum()} null values")

Column Country has 0 null values
Column EdLevel has 0 null values
Column YearsCode has 0 null values
Column ConvertedComp has 0 null values
Column Age has 0 null values
Column Gender has 0 null values

#### Job Satisfaction Data Set

In [18]:
#Load the data set 
filepath = "./ResourcesFiles/2019survey_results_public.csv"  # Load the dataset.
JobSatData= pd.read_csv(filepath, usecols=[ 'Gender','Country','JobSat','UndergradMajor',])
Job_sat_df = JobSatData[(JobSatData['Country'] == 'United States')].dropna()#take only values with US & drop null values
Job_sat_df.head(1)

,Country,UndergradMajor,JobSat,Gender
3,United States,"Computer science, computer engineering, or sof...",Slightly satisfied,Man

### Women only DataFrame

In [20]:
### Select gender equal to women Column 
stack_women_df= stack_df[(stack_df ['Gender'] == 'Woman')]
stack_women_df.head()

,Country,EdLevel,YearsCode,ConvertedComp,Age,Gender
34,United States,"Bachelor’s degree (BA, BS, B.Eng., etc.)",14,80000.0,35.0,Woman
140,United States,"Bachelor’s degree (BA, BS, B.Eng., etc.)",8,180000.0,24.0,Woman
146,United States,"Bachelor’s degree (BA, BS, B.Eng., etc.)",7,135000.0,28.0,Woman
306,United States,"Master’s degree (MA, MS, M.Eng., MBA, etc.)",5,140000.0,36.0,Woman
314,United States,Some college/university study without earning ...,10,84000.0,22.0,Woman

### Man Only DataFrame

In [21]:
# Select only the data with the gender equal to "Man"
stack_men_df= stack_df[(stack_df ['Gender'] == 'Man')]
stack_men_df.head()

,Country,EdLevel,YearsCode,ConvertedComp,Age,Gender
3,United States,"Bachelor’s degree (BA, BS, B.Eng., etc.)",3,61000.0,22.0,Man
12,United States,"Master’s degree (MA, MS, M.Eng., MBA, etc.)",17,90000.0,28.0,Man
21,United States,Some college/university study without earning ...,35,103000.0,47.0,Man
22,United States,"Bachelor’s degree (BA, BS, B.Eng., etc.)",3,69000.0,22.0,Man
25,United States,Some college/university study without earning ...,12,114000.0,34.0,Man

In [22]:
# Save New cleaned File 
#output_file_path = "../Resources/2020StackOverFlow_DevSurvey/clean_survey_results_public.csv""]
#us_df.to_csv(output_file_path, index=False)